## Inserting Data into Table

Let us understand how we can take care of insert into table using Python based approach.

* Here are the typical steps we need to follow:
  * Make sure we have data in the form of an object or collection.
  * Establish the connection to database.
  * Create cursor object.
  * Execute query statement using `cursor.execute` by passing the query statement. 
  * We need to pass the object or collection as an additional argument along with query statement.
  * We can insert one object at a time using `execute` and multiple objects at a time using `executemany`.
* If you are not familiar about how to directly insert data into the table using Database level operations, you can go through [this topic](https://www.youtube.com/watch?v=JbqM5xxh-KY&list=PLf0swTFhTI8p2yirPMTUhJ2xzuQhhUTwY&index=12) to understand the details.
> One need to have decent database and SQL skills to be comfortable with all types of application development. Feel free to **Master SQL using Postgresql** as target database using [this course](https://postgresql.itversity.com) or [playlist](https://www.youtube.com/playlist?list=PLf0swTFhTI8p2yirPMTUhJ2xzuQhhUTwY).* Here is the create table statement using which we have created users table.

```sql
CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN DEFAULT FALSE,
    user_password VARCHAR(200),
    user_role VARCHAR(1) NOT NULL DEFAULT 'U', --U and A
    is_active BOOLEAN DEFAULT FALSE,
    create_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);
```

In [25]:
%run 05_function_get_database_connection.ipynb

```{note}
Here is an example to insert one record using hard coded values.
```

In [26]:
# Here is the insert statement to insert one record
# INSERT INTO users (user_first_name, user_last_name, user_email_id)
# VALUES ('Scott', 'Tiger', 'scott@tiger.com')

cursor = sms_connection.cursor()
query = ("""
    INSERT INTO users 
        (user_first_name, user_last_name, user_email_id)
    VALUES 
        ('Scott', 'Tiger', 'scott@tiger.com')
""")
cursor.execute(query)
sms_connection.commit()

cursor.close()
sms_connection.close()

In [27]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [28]:
%env DATABASE_URL=postgresql://itv002480_sms_user:aovcbi6mp6qz1womp2qxtybt5qo8lmxu@pg.itversity.com:5433/itv002480_sms_db

env: DATABASE_URL=postgresql://itv002480_sms_user:aovcbi6mp6qz1womp2qxtybt5qo8lmxu@pg.itversity.com:5433/itv002480_sms_db

In [29]:
%sql SELECT * FROM users

 * postgresql://itv002480_sms_user:***@pg.itversity.com:5433/itv002480_sms_db
1 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2022, 5, 2, 6, 34, 9, 427248), datetime.datetime(2022, 5, 2, 6, 34, 9, 427248))]

```{note}
Inserting one record using variables for column values.
```

In [30]:
%run 05_function_get_database_connection.ipynb

In [31]:
# Here is the insert statement to insert one record
# INSERT INTO users (user_first_name, user_last_name, user_email_id)
# VALUES ('Donald', 'Duck', 'donald@duck.com')

cursor = sms_connection.cursor()
query = ("""
    INSERT INTO users 
        (user_first_name, user_last_name, user_email_id)
    VALUES 
        (%s, %s, %s)
""")

user = ('Donald', 'Duck', 'donald@duck.com')
cursor.execute(query, user)
sms_connection.commit()

cursor.close()
sms_connection.close()

In [32]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [33]:
%env DATABASE_URL=postgresql://sms_user:itversity@pg.itversity.com:5432/sms_db

env: DATABASE_URL=postgresql://sms_user:itversity@pg.itversity.com:5432/sms_db

In [34]:
%sql SELECT * FROM users

 * postgresql://itv002480_sms_user:***@pg.itversity.com:5433/itv002480_sms_db
2 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2022, 5, 2, 6, 34, 9, 427248), datetime.datetime(2022, 5, 2, 6, 34, 9, 427248)),
 (2, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2022, 5, 2, 6, 34, 9, 750595), datetime.datetime(2022, 5, 2, 6, 34, 9, 750595))]

```{note}
Creating function insert one user at a time.
```

In [35]:
def add_user(connection, user):
    cursor = connection.cursor()
    query = ("""
        INSERT INTO users 
            (user_first_name, user_last_name, user_email_id, user_role, is_active)
        VALUES 
            (%s, %s, %s, %s, %s)
    """)

    cursor.execute(query, user)
    connection.commit()

    cursor.close()

In [36]:
%run 05_function_get_database_connection.ipynb

In [37]:
user = ('Mickey', 'Mouse', 'mickey@mouse.com', 'U', True)

In [38]:
add_user(sms_connection, user)

In [39]:
sms_connection.close()

In [40]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [41]:
%env DATABASE_URL=postgresql://itversity_sms_user:sms_password@localhost:5432/itversity_sms_db

env: DATABASE_URL=postgresql://itversity_sms_user:sms_password@localhost:5432/itversity_sms_db

In [42]:
%sql SELECT * FROM users

 * postgresql://itv002480_sms_user:***@pg.itversity.com:5433/itv002480_sms_db
3 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2022, 5, 2, 6, 34, 9, 427248), datetime.datetime(2022, 5, 2, 6, 34, 9, 427248)),
 (2, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2022, 5, 2, 6, 34, 9, 750595), datetime.datetime(2022, 5, 2, 6, 34, 9, 750595)),
 (3, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2022, 5, 2, 6, 34, 10, 227713), datetime.datetime(2022, 5, 2, 6, 34, 10, 227713))]

```{note}
Inserting multiple records (list of objects) at once using `executemany`.
```

In [43]:
%run 05_function_get_database_connection.ipynb

In [44]:
# Here is the insert statement to insert one record
# INSERT INTO users 
#     (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
# VALUES 
#     ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
#     ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
#     ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true)

cursor = sms_connection.cursor()
query = ("""
    INSERT INTO users 
        (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active)
    VALUES 
        (%s, %s, %s, %s, %s, %s)
""")

users = [
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', True),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', True),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', True)
]

cursor.executemany(query, users)
sms_connection.commit()

cursor.close()
sms_connection.close()

In [45]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [46]:
%env DATABASE_URL=postgresql://sms_user:itversity@pg.itversity.com:5432/sms_db

env: DATABASE_URL=postgresql://sms_user:itversity@pg.itversity.com:5432/sms_db

In [47]:
%sql SELECT * FROM users

 * postgresql://itv002480_sms_user:***@pg.itversity.com:5433/itv002480_sms_db
6 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2022, 5, 2, 6, 34, 9, 427248), datetime.datetime(2022, 5, 2, 6, 34, 9, 427248)),
 (2, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2022, 5, 2, 6, 34, 9, 750595), datetime.datetime(2022, 5, 2, 6, 34, 9, 750595)),
 (3, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2022, 5, 2, 6, 34, 10, 227713), datetime.datetime(2022, 5, 2, 6, 34, 10, 227713)),
 (4, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2022, 5, 2, 6, 34, 10, 558752), datetime.datetime(2022, 5, 2, 6, 34, 10, 558752)),
 (5, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2022, 5, 2, 6, 34, 10, 558752), datetime.datetime(2022, 5, 2, 6, 34, 10, 558752)),
 (6, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2022, 5, 2, 6, 34, 10, 558752), datetime.datetime(2022, 5, 2, 6, 34, 10, 558752))]